WS-I/BP1.2/Messages/BaseDataTypes/XmlFormatter/DocLitW/SoapWsdl.BaseDataTypes.XmlFormatter.DocLitWrapped_RetDecimal_Client_Request-13.xml

<s:Envelope xmlns:a="http://www.w3.org/2005/08/addressing" xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Header>
    <a:Action s:mustUnderstand="1">http://tempuri.org/IBaseDataTypesDocLitW/RetDecimal</a:Action>
    <a:MessageID>urn:uuid:4c1df053-7418-4005-8b28-b27d2638f5a5</a:MessageID>
    <a:ReplyTo>
      <a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address>
    </a:ReplyTo>
  </s:Header>
  <s:Body>
    <RetDecimal xmlns="http://tempuri.org/">
      <inDecimal>12678967.543233</inDecimal>
    </RetDecimal>
  </s:Body>
</s:Envelope>